In [1]:
import pandas as pd

In [5]:
df1 = pd.DataFrame({'AGE':[20,25,30],'INCOME':[21000,26000,30000]})
df2 = pd.DataFrame({'WEIGHT':[50,75,100],'HEIGHT':[5,5.5,6]})
df1, df2

(   AGE  INCOME
 0   20   21000
 1   25   26000
 2   30   30000,
    WEIGHT  HEIGHT
 0      50     5.0
 1      75     5.5
 2     100     6.0)

In [7]:
df1

   AGE  INCOME
0   20   21000
1   25   26000
2   30   30000

In [9]:
df2

   WEIGHT  HEIGHT
0      50     5.0
1      75     5.5
2     100     6.0

In [15]:
r1 = df1.rename(columns = {'AGE':'age','INCOME':'income'})
r1

   age  income
0   20   21000
1   25   26000
2   30   30000

In [27]:
c1 = pd.concat([df1,df2], axis = 1)
c1

   AGE  INCOME  WEIGHT  HEIGHT
0   20   21000      50     5.0
1   25   26000      75     5.5
2   30   30000     100     6.0